In [48]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

In [49]:
sales = pd.read_csv('Data/sales_data.csv', parse_dates=['Date'])

sales.head()

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2013-11-26,26,November,2013,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
1,2015-11-26,26,November,2015,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
2,2014-03-23,23,March,2014,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23,45,120,1366,1035,2401
3,2016-03-23,23,March,2016,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20,45,120,1188,900,2088
4,2014-05-15,15,May,2014,47,Adults (35-64),F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4,45,120,238,180,418

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

In [50]:
sales.shape
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113036 entries, 0 to 113035
Data columns (total 18 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Date              113036 non-null  datetime64[ns]
 1   Day               113036 non-null  int64
 2   Month             113036 non-null  object
 3   Year              113036 non-null  int64
 4   Customer_Age      113036 non-null  int64
 5   Age_Group         113036 non-null  object
 6   Customer_Gender   113036 non-null  object
 7   Country           113036 non-null  object
 8   State             113036 non-null  object
 9   Product_Category  113036 non-null  object
 10  Sub_Category      113036 non-null  object
 11  Product           113036 non-null  object
 12  Order_Quantity    113036 non-null  int64
 13  Unit_Cost         113036 non-null  int64
 14  Unit_Price        113036 non-null  int64
 15  Profit            113036 non-null  int64
 16  Cost              113036 non-null  int64
 17  Revenue           113036 non-null  int64
dtypes: datetime64[ns](1), int64(9), object(8)
memory usage: 15.5+ MB

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

In [51]:
sales.isnull().sum()

Date                0
Day                 0
Month               0
Year                0
Customer_Age        0
Age_Group           0
Customer_Gender     0
Country             0
State               0
Product_Category    0
Sub_Category        0
Product             0
Order_Quantity      0
Unit_Cost           0
Unit_Price          0
Profit              0
Cost                0
Revenue             0
dtype: int64

> ***NotNull, NotNA significam quais colunas contem valores QUE NAO SAO Nulos ou NA (not a number)***

> ***Enquanto que as funcoes isnull e isna tem a logica contraria, e mostra quantos registros nulos existem em cada coluna***

> ***Valido usar o funcao de agregacao sum() ao final de cada um desses para saber a qtd total por coluna, assim temos uma analise descritiva desses***

In [52]:
sales.isnull().sum()

Date                0
Day                 0
Month               0
Year                0
Customer_Age        0
Age_Group           0
Customer_Gender     0
Country             0
State               0
Product_Category    0
Sub_Category        0
Product             0
Order_Quantity      0
Unit_Cost           0
Unit_Price          0
Profit              0
Cost                0
Revenue             0
dtype: int64

In [53]:
sales.isna().sum()

Date                0
Day                 0
Month               0
Year                0
Customer_Age        0
Age_Group           0
Customer_Gender     0
Country             0
State               0
Product_Category    0
Sub_Category        0
Product             0
Order_Quantity      0
Unit_Cost           0
Unit_Price          0
Profit              0
Cost                0
Revenue             0
dtype: int64

In [54]:
sales.notnull().sum()

Date                113036
Day                 113036
Month               113036
Year                113036
Customer_Age        113036
Age_Group           113036
Customer_Gender     113036
Country             113036
State               113036
Product_Category    113036
Sub_Category        113036
Product             113036
Order_Quantity      113036
Unit_Cost           113036
Unit_Price          113036
Profit              113036
Cost                113036
Revenue             113036
dtype: int64

In [55]:
a = sales.notna().sum()

In [56]:
a.loc[a[:] > 0]

Date                113036
Day                 113036
Month               113036
Year                113036
Customer_Age        113036
Age_Group           113036
Customer_Gender     113036
Country             113036
State               113036
Product_Category    113036
Sub_Category        113036
Product             113036
Order_Quantity      113036
Unit_Cost           113036
Unit_Price          113036
Profit              113036
Cost                113036
Revenue             113036
dtype: int64

In [57]:
#Analise descritiva do conjunto de dados
sales.describe()

,Day,Year,Customer_Age,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
count,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000
mean,15.665753,2014.401739,35.919212,11.901660,267.296366,452.938427,285.051665,469.318695,754.370360
std,8.781567,1.272510,11.021936,9.561857,549.835483,922.071219,453.887443,884.866118,1309.094674
min,1.000000,2011.000000,17.000000,1.000000,1.000000,2.000000,-30.000000,1.000000,2.000000
25%,8.000000,2013.000000,28.000000,2.000000,2.000000,5.000000,29.000000,28.000000,63.000000
50%,16.000000,2014.000000,35.000000,10.000000,9.000000,24.000000,101.000000,108.000000,223.000000
75%,23.000000,2016.000000,43.000000,20.000000,42.000000,70.000000,358.000000,432.000000,800.000000
max,31.000000,2016.000000,87.000000,32.000000,2171.000000,3578.000000,15096.000000,42978.000000,58074.000000

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

### Numpy quick overview

In [58]:
#[] cada conjunto de colchetes se lê como as linhas, e cada elemento dentro do conjumento se le como colunas por elemento
# aqui se lê um array de 3 Linhas e 4 Colunas
#Obs a quantidade de elementos dentro dos conjuntos deve ser a mesma, caso não seja, deve-se especificar o tipo Object em dtype
mx_A = np.array([[1,2,3,10], [4,5,6,11], [7,8,9,10]], dtype=np.int8)

#Nao da erro por deixar explicito o tipo Object, mas não sei exatamente o impacto e usuabilidade disso.
mx_object = np.array([[1,2], [4,5,6,11], [7,8,9]], dtype=object)

mx_A.size

#Linha,Coluna nesse caso pode-se fazer também o slicing -> Maneira mais eficaz, mas também funciona do jeito raiz A[Linha][Coluna]
print("Slicing: ", mx_A[1:3, :])

print("Raiz: ", mx_A[0][1:3])

Slicing:  [[ 4  5  6 11]
 [ 7  8  9 10]]
Raiz:  [2 3]

In [59]:
#Para cubos aninhados a leitura é parecida, porém cada Linha representa o grupo maior de colchetes
#Cada conjunto de colchetes interno se lê como a dimensão interna dentro da linha
#Cada elemento dentro do conjunto interno é o total de colunas, nesse caso temos um cubo de 3 Linhas, 2 Dimensões e 4 Colunas

mx_B = np.array([
    [
        [10,20,30,39],
        [10,20,30,39],
    ],
    [
        [60,70,80,89],
        [10,20,30,39],
    ],
    [
        [1,2,3,4],
        [10,20,30,39],
    ]

])

In [60]:
mx_A.dtype

dtype('int8')

In [61]:
mx_A.dtype = np.int8
mx_A.dtype

dtype('int8')

In [62]:
print("Dimensions of the Matrix A: ", mx_A.ndim)
print("Dimensions of the Matrix B: ", mx_B.ndim)

Dimensions of the Matrix A:  2
Dimensions of the Matrix B:  3

In [63]:
print("Shape of the matrix A: ", mx_A.shape)
print("Size of the matrix A", mx_A.size)

print("Shape of the matrix B: ", mx_B.shape)
print("Size of the matrix B", mx_B.size)

Shape of the matrix A:  (3, 4)
Size of the matrix A 12
Shape of the matrix B:  (3, 2, 4)
Size of the matrix B 24

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

> **Numpy oferece funcoes matematicas nativas, que podem ser usadas tanto para o conjunto inteiro ou exclusivamente para Linhas (axis=1) ou Colunas (axis=0)**

In [64]:
#mx_A = np.array([
#   [1,2,3,10],
#   [4,5,6,11],
#   [7,8,9,10]], dtype=np.int8)
#   Soma de todos os elementos das colunas 
mx_A.sum(axis=0)

array([12, 15, 18, 31])

In [65]:
#mx_A = np.array([
#   [1,2,3,10],
#   [4,5,6,11],
#   [7,8,9,10]], dtype=np.int8)
#   Soma de todos os elementos das Linhas
mx_A.sum(axis=1)

array([16, 26, 34])

In [66]:
#Como o multidimensional, usamos o axis=2 para calcular esse eixo
'''
mx_B = np.array([
    [
        [10,20,30,39],
        [10,20,30,39],
    ],
    [
        [60,70,80,89],
        [10,20,30,39],
    ],
    [
        [1,2,3,4],
        [10,20,30,39],
    ]

])
Axis=0 ele calcula primeiro os valores das primeiras linhas de cada conjunto ex: 10+60+1 | 20+70+2 | ...
em seguida ele faz os calculos dos valores da dimensao interna 10+10+10 | 20+20+20 |...

Axis=1 ele calcula os valores das linhas e suas dimensoes 60+10 | 70+20 | 80+30 |...
'''
mx_B.sum(axis=1)

array([[ 20,  40,  60,  78],
       [ 70,  90, 110, 128],
       [ 11,  22,  33,  43]])

In [67]:
mx_result_1 = [(mx_B > 60) & (mx_B < 90)]
print(mx_result_1)

mx_result_2 = mx_B >20
print(mx_result_2)

[array([[[False, False, False, False],
        [False, False, False, False]],

       [[False,  True,  True,  True],
        [False, False, False, False]],

       [[False, False, False, False],
        [False, False, False, False]]])]
[[[False False  True  True]
  [False False  True  True]]

 [[ True  True  True  True]
  [False False  True  True]]

 [[False False False False]
  [False False  True  True]]]

> **Baixar os notebooks dos exercicios no Fork que eu fiz no meu GitHub para praticar mais essa lib**
 
![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

### Pandas Series

In [68]:
g7_pop = pd.Series([35.467, 63.951, 80.940, 60.655, 127.061, 64.511, 318.523])

g7_pop.name = "G7 population in millions"

g7_pop

0     35.467
1     63.951
2     80.940
3     60.655
4    127.061
5     64.511
6    318.523
Name: G7 population in millions, dtype: float64

In [69]:
#Implicitamente Pandas.Series criam um array de numpy para manipular os valores, o bacana é que se pode dar nome para a Serie.
#Uma vez criado as series nao da pra alterar mais os index da Series, mas é possível se atribuir os nomes para cada um dos indices

print(type(g7_pop.values))
g7_pop.index

<class 'numpy.ndarray'>

RangeIndex(start=0, stop=7, step=1)

In [70]:
g7_pop.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.655
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 population in millions, dtype: float64

In [71]:
g7_pop['France' : 'United Kingdom']

France             63.951
Germany            80.940
Italy              60.655
Japan             127.061
United Kingdom     64.511
Name: G7 population in millions, dtype: float64

In [72]:
g7_pop['United States']

318.523

In [331]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'])

In [332]:
df

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [333]:
df.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [76]:
df.iloc[:][['Population', 'GDP', 'Continent']].sort_values(by='GDP', ascending=False)

                Population       GDP Continent
United States      318.523  17348075   America
Japan              127.061   4602367      Asia
Germany             80.940   3874437    Europe
United Kingdom      64.511   2950039    Europe
France              63.951   2833687    Europe
Italy               60.665   2167744    Europe
Canada              35.467   1785387   America

In [77]:
df.iloc[-1][['Continent', 'Population']]

Continent     America
Population    318.523
Name: United States, dtype: object

In [334]:
df.loc[df['Continent'] != 'Europe']

               Population       GDP  Surface Area    HDI Continent
Canada             35.467   1785387       9984670  0.913   America
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [335]:
df.loc[(df['Continent'] == 'Europe') & (df['Population'] < 70.000), ['Population', 'GDP', 'Surface Area']]

                Population      GDP  Surface Area
France              63.951  2833687        640679
Italy               60.665  2167744        301336
United Kingdom      64.511  2950039        242495

In [80]:
df.iloc[:].sort_values(ascending=False, by='Surface Area')

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
United States      318.523  17348075       9525067  0.915   America
France              63.951   2833687        640679  0.888    Europe
Japan              127.061   4602367        377930  0.891      Asia
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
United Kingdom      64.511   2950039        242495  0.907    Europe

In [81]:
df.sort_values(ascending=False, by='HDI')

                Population       GDP  Surface Area    HDI Continent
Germany             80.940   3874437        357114  0.916    Europe
United States      318.523  17348075       9525067  0.915   America
Canada              35.467   1785387       9984670  0.913   America
United Kingdom      64.511   2950039        242495  0.907    Europe
Japan              127.061   4602367        377930  0.891      Asia
France              63.951   2833687        640679  0.888    Europe
Italy               60.665   2167744        301336  0.873    Europe

In [336]:
#iLoc pega do elemento index do 1 ao 4, e as colunas 0,2,3
df.iloc[1:4, [0,2,3]]

         Population  Surface Area    HDI
France       63.951        640679  0.888
Germany      80.940        357114  0.916
Italy        60.665        301336  0.873

In [337]:
df.loc[lambda df: df['GDP'] >3000000]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [84]:
df.loc[lambda df: df['HDI'] >0.90]

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
Germany             80.940   3874437        357114  0.916    Europe
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [85]:
df.loc[(lambda df: df['Surface Area'] > 300000)].sort_values(by='GDP')

               Population       GDP  Surface Area    HDI Continent
Canada             35.467   1785387       9984670  0.913   America
Italy              60.665   2167744        301336  0.873    Europe
France             63.951   2833687        640679  0.888    Europe
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

### Operacao Matematica com colunas do DF

In [338]:
#Operacoes matematicas entre colunas, pode ser realizado com as funcoes proprias do pandas (sum, sub, div, multiply. etc) pesquisar mais sobre elas
df['Per Capta'] = df['GDP'].div(df['Population'])

In [339]:
df['Per Capta'].astype('float32')

Canada            50339.386719
France            44310.285156
Germany           47868.011719
Italy             35733.027344
Japan             36221.710938
United Kingdom    45729.238281
United States     54464.121094
Name: Per Capta, dtype: float32

In [340]:
df['GDP'].multiply(2)

Canada             3570774
France             5667374
Germany            7748874
Italy              4335488
Japan              9204734
United Kingdom     5900078
United States     34696150
Name: GDP, dtype: int64

### Condicionamento de Index através das Colunas

In [341]:
df.loc[(df['GDP'].div(df['Population']) > 50000.00 )]

,Population,GDP,Surface Area,HDI,Continent,Per Capta
Canada,35.467,1785387,9984670,0.913,America,50339.385908
United States,318.523,17348075,9525067,0.915,America,54464.120330

In [342]:
df.groupby(by=['Continent']).agg('sum')

           Population       GDP  Surface Area    HDI      Per Capta
Continent
America       353.990  19133462      19509737  1.828  104803.506238
Asia          127.061   4602367        377930  0.891   36221.712406
Europe        270.067  11825907       1541624  3.584  173640.563387

> __Diferenca entre size e count é que o size conta o tamanho dos elementos similar ao count no SQL, enquanto o count faz a contagem dos elementos por colunas__

In [343]:
df.groupby(by=['Continent']).size()

Continent
America    2
Asia       1
Europe     4
dtype: int64

In [344]:
df.groupby(by=['Continent']).count()

           Population  GDP  Surface Area  HDI  Per Capta
Continent
America             2    2             2    2          2
Asia                1    1             1    1          1
Europe              4    4             4    4          4

In [91]:
# aqui e o exemplo de matrix boleana, aonde dentro de uma condicao para a coluna, traz se eh verdadeiro e falso pelos indices, o que eh retornado e uma Series
df['Population'] > 70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: Population, dtype: bool

In [92]:
#Aqui é o exemplo de como o resultado da condicao boleana, se apresenta quando utilizado o loc,
#  pois o loc processa os valores dos indices verdadeiro para todas as colunas, da pra ver que como acima somente veio os valores para 
# Alemanha, Japão e USA 
# O resultado é computado sem problemas, pois a Series gerada internamente eh originaria do DataFrame, então mesmo sendo objetos diferentes
# Os valores dos indices sao os mesmos 
df.loc[df['Population'] > 70]

,Population,GDP,Surface Area,HDI,Continent,Per Capta
Germany,80.940,3874437,357114,0.916,Europe,47868.013343
Japan,127.061,4602367,377930,0.891,Asia,36221.712406
United States,318.523,17348075,9525067,0.915,America,54464.120330

In [93]:
#Mesmo que acima, so inseri uma condicional a mais
df.loc[(df['Population'] > 70) & (df['HDI'] > 0.9)]

,Population,GDP,Surface Area,HDI,Continent,Per Capta
Germany,80.940,3874437,357114,0.916,Europe,47868.013343
United States,318.523,17348075,9525067,0.915,America,54464.120330

In [94]:
df.columns

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent', 'Per Capta'], dtype='object')

### Verificar colunas no DF

In [95]:
#To check all columns on the dataframe matches the given list

list_cols = ['Population', 'GDP', 'HDI', 'Continent', 'Per Capta', 'Surface Area']

if all([col in df.columns for col in list_cols]):
    print('Everythin OK')
else:
    print('Missing columns', list_cols, df.columns)

Everythin OK

In [96]:
df.columns

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent', 'Per Capta'], dtype='object')

In [97]:
if list_cols[1] in df.columns:
    print(f'Coluna: {list_cols[1]} existente no DataFrame')
else:
    print('Colunas mandatorias ausentes')

Coluna: GDP existente no DataFrame

In [98]:
#Pode-se fazer drop de Indice, ou colunas, no exemplo abaixo so a coluna se quiser mais colunas, deve=se colocar em lista['colA', 'colB', '...']
df.drop(columns='Per Capta')

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

### Operacoes com Series

> ### Aqui o esquema, é que podemos definir valores fixados, como por exemplo tarifas, ou taxas de juros, e dizer em quais indices ela vai ser aplicada, assim qdo o agrupamento ou operacao matematica do DF com a Series, os valores serao atualizados, pois os Indices batem

In [99]:
#Aqui quero dizer que quando ocorrer uma crise, o GDP dos Paises (index) vão sofrer uma perda de 1Mi, enquanto o HDI vai perder 0.3
crisis = pd.Series([-1_000_000, -0.3], index=['GDP', 'HDI'])
crisis

GDP   -1000000.0
HDI         -0.3
dtype: float64

In [100]:
df[['GDP', 'HDI']]

                     GDP    HDI
Canada           1785387  0.913
France           2833687  0.888
Germany          3874437  0.916
Italy            2167744  0.873
Japan            4602367  0.891
United Kingdom   2950039  0.907
United States   17348075  0.915

In [101]:
df[['GDP', 'HDI']] + crisis

                       GDP    HDI
Canada            785387.0  0.613
France           1833687.0  0.588
Germany          2874437.0  0.616
Italy            1167744.0  0.573
Japan            3602367.0  0.591
United Kingdom   1950039.0  0.607
United States   16348075.0  0.615

### Alterando o DataFrame com novas colunas

In [102]:
langs = pd.Series(data=['French', 'German', 'Italian'], index=['France', 'Germany', 'Italy'], name='Language')

In [103]:
df['Language'] = langs
df

,Population,GDP,Surface Area,HDI,Continent,Per Capta,Language
Canada,35.467,1785387,9984670,0.913,America,50339.385908,NaN
France,63.951,2833687,640679,0.888,Europe,44310.284437,French
Germany,80.940,3874437,357114,0.916,Europe,47868.013343,German
Italy,60.665,2167744,301336,0.873,Europe,35733.025633,Italian
Japan,127.061,4602367,377930,0.891,Asia,36221.712406,NaN
United Kingdom,64.511,2950039,242495,0.907,Europe,45729.239975,NaN
United States,318.523,17348075,9525067,0.915,America,54464.120330,NaN

In [104]:
# Um dataframe só é modificado diretamente no seu objeto quando utilizamos o sinal de = para atribuicao de valores
# Quaisquer outras operacoes, o retorno é sempre um Dataframe ou Series com o valor alterado, se quisermos mantermos as alteracoes
# No DF de origem, devemos utilizar o parametro inplace como valor True.  
df.rename(
    columns={
        'HDI' : 'Human Development Idx',
        'Anual Popcorn Consumption' : 'APAC',
        'Continent' : 'Region'
    },
    index={
        'United States' : 'USA',
        'United Kingdom' : 'UK',
        'Argentina' : 'ARG',
        'Brazil' : 'BRA'
    }, inplace=True
)

In [105]:
#Exemplo de como uma atribuição altera todo o valor do DataFrame e nao uma nova Copia
langs2 = pd.Series(
    data=[
        'English and French',
        'French',
        'German',
        'Italian',
        'Japanese',
        'English',
        'English'
    ],
    index=[
        'Canada',
        'France',
        'Germany',
        'Italy',
        'Japan',
        'USA',
        'UK'
    ],
    name='Lang_by_country'
)

In [106]:
df['Language']

Canada         NaN
France      French
Germany     German
Italy      Italian
Japan          NaN
UK             NaN
USA            NaN
Name: Language, dtype: object

In [107]:
langs2

Canada     English and French
France                 French
Germany                German
Italy                 Italian
Japan                Japanese
USA                   English
UK                    English
Name: Lang_by_country, dtype: object

In [108]:
df['Language'] = langs2

In [109]:
df[['Language', 'Population']]

                   Language  Population
Canada   English and French      35.467
France               French      63.951
Germany              German      80.940
Italy               Italian      60.665
Japan              Japanese     127.061
UK                  English      64.511
USA                 English     318.523

### Marcacao de colunas nulas / nao nulas, e manipulacao das colunas que deseja alterar os valores

In [122]:
'''
Excelente exemplo, pois aqui utilizo a funcao is null, para saber quais colunas tem valores nulos
O total disso jogo para um outro DF/Series a que posso depois filtrar somente o resultado das colunas que tiveram seus valores nulos
O que pode agilizar a manipulação paralela desse outro DataFrame para a normalização do mesmo, e ao final fazer o merge com os dataframe originario
'''
a = pd.isnull(pd.DataFrame(
    {
        'Col-A' : [1, 4, 10],
        'Col-B' : [np.nan, 3, np.nan],
        'Col-C' : [10, np.nan, 8],
        'Col-D' : [np.nan,np.nan,np.nan]
    }
)).sum()

In [118]:
result_nulls = a.loc[a[:]>0]

In [123]:
result_nulls

Col-B    2
Col-C    1
Col-D    3
dtype: int64

In [148]:
a

Col-A    0
Col-B    2
Col-C    1
Col-D    3
dtype: int64

In [153]:
list = result_nulls.loc[:].to_dict()
list

{'Col-B': 2, 'Col-C': 1, 'Col-D': 3}

In [154]:
#Para manipular chave e valor utilizar dict.items()
for chave, valor in list.items():
    print(chave, valor)

Col-B 2
Col-C 1
Col-D 3

In [155]:
#Para receber apenas o valor, utilizar dict.values()
for valor in list.values():
    print(valor)

2
1
3

In [156]:
#Para receber apenas as chaves, utilizar dict.keys()
for valor in list.keys():
    print(valor)

Col-B
Col-C
Col-D

### Metodos para dropar colunas ou linhas com nulos

In [164]:
a_drop = pd.DataFrame(
    {
        'Col-A' : [1, 4, 10],
        'Col-B' : [np.nan, 3, np.nan],
        'Col-C' : [10, np.nan, 8],
        'Col-D' : [2,np.nan,4]
    }
)

### Drop & Handling de valores (colunas e linhas) nulos

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

> **dropna() por padrao elimina todas as linhas do DF que contem os valores nulos ao menos 1 valor nulo**

> **dropna(axis=1) exclusao por coluna elimina todas as colunas que tem ao menos 1 valor nulo**

> **Parametros para o dropna how='all' dropa apenas as linhas ou colunas que contem todos os valores nulos**

> **how='any' comportamento padrao, qdo tem qualquer valor nulo (a partir de 1), ja exclui a linha ou coluna**

> **thresh=x valor de threshold no qual se estipula a partir de qts valores nulos que a linha ou coluna sera excluida**

In [314]:
a_drop

   Col-A  Col-B  Col-C  Col-D
0      1    NaN   10.0    2.0
1      4    3.0    NaN    NaN
2     10    NaN    8.0    4.0

In [170]:
a_drop.dropna(axis=1, thresh=2)

   Col-A  Col-C  Col-D
0      1   10.0    2.0
1      4    NaN    NaN
2     10    8.0    4.0

In [171]:
a_drop.dropna(how='all')

   Col-A  Col-B  Col-C  Col-D
0      1    NaN   10.0    2.0
1      4    3.0    NaN    NaN
2     10    NaN    8.0    4.0

In [172]:
a_drop.fillna(-9)

   Col-A  Col-B  Col-C  Col-D
0      1   -9.0   10.0    2.0
1      4    3.0   -9.0   -9.0
2     10   -9.0    8.0    4.0

In [176]:
a_drop.fillna(a_drop.mean())

   Col-A  Col-B  Col-C  Col-D
0      1    3.0   10.0    2.0
1      4    3.0    9.0    3.0
2     10    3.0    8.0    4.0

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

> **method = backfill ou ffill significa a ordem pela qual o preenchimento dos valores nulos vai comecar se a partir do primeiro registro ou do ultimo, e a escolha tem impacto nos valores estabelecidos automaticamente, pode-se ver no exemplo abaixo que a col-b ainda manteve valores nulos, porem em posicoes diferentes, enquanto os valores preenchidos nas colunas C e D tbm diferem**

In [178]:
a_drop.fillna(method='bfill')

   Col-A  Col-B  Col-C  Col-D
0      1    3.0   10.0    2.0
1      4    3.0    8.0    4.0
2     10    NaN    8.0    4.0

In [184]:
a_drop.fillna(method='ffill')

   Col-A  Col-B  Col-C  Col-D
0      1    NaN   10.0    2.0
1      4    3.0   10.0    2.0
2     10    3.0    8.0    4.0

In [313]:
#Eixo de preenchimento pode ser pela linha = 1 ou coluna = 0 e isso tambem impacta o preenchimento
# Como pode ver abaixo utilizando o 0 padrão como acima, os valores nao se alteraram, porém ao especificar 1, no bloco abaixo
# os valores sao alterados, pois considera-se o valor anterior da linha, para se estipular o valor a ser preenchido 
a_drop.fillna(method='ffill', axis=0)

   Col-A  Col-B  Col-C  Col-D
0      1    NaN   10.0    2.0
1      4    3.0   10.0    2.0
2     10    3.0    8.0    4.0

In [187]:
a_drop.fillna(method='ffill', axis=1)

   Col-A  Col-B  Col-C  Col-D
0    1.0    1.0   10.0    2.0
1    4.0    3.0    3.0    3.0
2   10.0   10.0    8.0    4.0

In [188]:
a_drop

   Col-A  Col-B  Col-C  Col-D
0      1    NaN   10.0    2.0
1      4    3.0    NaN    NaN
2     10    NaN    8.0    4.0

### Handling and Parsing Data

In [281]:
df_ppl = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})
df_ppl

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

> Funcoes interessantes para verificar os valores unicos para uma coluna, e a quantidade de registros com os grupos de valores

In [266]:
df_ppl['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [267]:
df_ppl['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [294]:
df_ppl['Sex'].replace(['D', '?'], 'F', inplace=True)

In [286]:
df_ppl.loc[df_ppl['Age'] > 100, 'Age']
df_ppl

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

> __Aqui foi muito interessante entender o raciocinio por tras das operacoes, e como alavancar isso no dia a dia, pois o exemplo eh separar as linhas (index) sobre determinada condicao da coluna nesse caso do df_ppl selecionar as linhas/index com idade maior que 100__

In [287]:
df_ppl.loc[df_ppl['Age'] > 100]

  Sex  Age
3   D  290

> __Aqui para pegar o valor mediano significativo para as linhas de usuarios com idade abaixo dos 100 anos, que deu 27__

In [288]:
df_ppl.loc[df_ppl['Age'] < 100, 'Age'].agg('mean')

27.0

In [292]:
df_ppl

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   27
4   ?   25

> __Em seguida combinar o segundo para atribuir o valor erroneo ou fora do esperado (outlier) com dados estatisticos de dentro do proprio modelo__

In [291]:
df_ppl.loc[df_ppl['Age'] > 100, 'Age'] = df_ppl.loc[df_ppl['Age'] < 100, 'Age'].agg('mean')

In [295]:
df_ppl

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   27
4   F   25

### Duplicates

In [297]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [303]:
# Keep é primeiro, ultimo ou False, False significa nao manter os registros duplicados, 
# o first considera a primeira ocorrencia e todas as seguintes como duplicates
# o last considera a ultima ocorrencia como verdadeira, e todas as anteriores como duplicates 
ambassadors.duplicated(keep='last')

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [315]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ],
    'Team' : [
        'LA Lakers',
        'Cleveland Cavaliers',
        'LA Lakers',
        'NY Knicks',
        'LA Lakers'
    ]
})

players

              Name Pos                 Team
0      Kobe Bryant  SG            LA Lakers
1     LeBron James  SF  Cleveland Cavaliers
2      Kobe Bryant  SG            LA Lakers
3  Carmelo Anthony  SF            NY Knicks
4      Kobe Bryant  SF            LA Lakers

In [316]:
#Subset é o campo que será considerado na avaliacao, se é duplicado ou nao
# Nesse caso deixamos o nome, pois com as posicoes, pode ser uma nova temporada ou jogos avaliados, 
# em que o  jogador atuou em posição diferente, considerando os ratinns que um jogador pode receber por partida
# pode ser interessante, pois no final avalia-se a posicao com maior valor de rating para um jogador 
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

### Handling and Splitting Columns

In [317]:
df_str = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [318]:
df_str['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [321]:
df_str['Data'].str.split('_', expand=True)

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

> **_Matplot lib part é bem chata, carra passou correndo não explicou nem superficialmente os recursos, pesquisar depois apesar de que isso dificilmente vai se aplicar para o contexto de aprendizado e desafios a frente_**

### Read files and SQL

> https://github.com/ine-rmotr-curriculum/RDP-Reading-Data-with-Python-and-Pandas/tree/master/unit-1-reading-data-with-python-and-pandas

__Funcoes basicas, passou correndo, mas explicou superficialmente algumas das principais funcoes como read_xxx e to_xxx buscar mais referências tanto na documentação do pandas, em outras fontes e também nos documentos da aula do Repo acima__

In [327]:
# utilizar o nome do metodo com ? e executar, retorna as opcoes de parametros e breve descricao da documentacao do metodo
pd.read_xml?

Signature:
pd.read_xml(
    path_or_buffer: 'FilePath | ReadBuffer[bytes] | ReadBuffer[str]',
    *,
    xpath: 'str' = './*',
    namespaces: 'dict[str, str] | None' = None,
    elems_only: 'bool' = False,
    attrs_only: 'bool' = False,
    names: 'Sequence[str] | None' = None,
    dtype: 'DtypeArg | None' = None,
    converters: 'ConvertersArg | None' = None,
    parse_dates: 'ParseDatesArg | None' = None,
    encoding: 'str | None' = 'utf-8',
    parser: 'XMLParsers' = 'lxml',
    stylesheet: 'FilePath | ReadBuffer[bytes] | ReadBuffer[str] | None' = None,
    iterparse: 'dict[str, list[str]] | None' = None,
    compression: 'CompressionOptions' = 'infer',
    storage_options: 'StorageOptions' = None,
) -> 'DataFrame'
Docstring:
Read XML document into a ``DataFrame`` object.

.. versionadded:: 1.3.0

Parameters
----------
path_or_buffer : str, path object, or file-like object
    String, path object (implementing ``os.PathLike[str]``), or file-like
    object implementing a ``read()`` function. The string can be any valid XML
    string or a path. The string can further be a URL. Valid URL schemes
    include http, ftp, s3, and file.

xpath : str, optional, default './\*'
    The XPath to parse required set of nodes for migration to DataFrame.
    XPath should return a collection of elements and not a single
    element. Note: The ``etree`` parser supports limited XPath
    expressions. For more complex XPath, use ``lxml`` which requires
    installation.

namespaces : dict, optional
    The namespaces defined in XML document as dicts with key being
    namespace prefix and value the URI. There is no need to include all
    namespaces in XML, only the ones used in ``xpath`` expression.
    Note: if XML document uses default namespace denoted as
    `xmlns='<URI>'` without a prefix, you must assign any temporary
    namespace prefix such as 'doc' to the URI in order to parse
    underlying nodes and/or attributes. For example, ::

        namespaces = {"doc": "https://example.com"}

elems_only : bool, optional, default False
    Parse only the child elements at the specified ``xpath``. By default,
    all child elements and non-empty text nodes are returned.

attrs_only :  bool, optional, default False
    Parse only the attributes at the specified ``xpath``.
    By default, all attributes are returned.

names :  list-like, optional
    Column names for DataFrame of parsed XML data. Use this parameter to
    rename original element names and distinguish same named elements and
    attributes.

dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.

    .. versionadded:: 1.5.0

converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.

    .. versionadded:: 1.5.0

parse_dates : bool or list of int or names or list of lists or dict, default False
    Identifiers to parse index or columns to datetime. The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    .. versionadded:: 1.5.0

encoding : str, optional, default 'utf-8'
    Encoding of XML document.

parser : {'lxml','etree'}, default 'lxml'
    Parser module to use for retrieval of data. Only 'lxml' and
    'etree' are supported. With 'lxml' more complex XPath searches
    and ability to use XSLT stylesheet are supported.

stylesheet : str, path object or file-like object
    A URL, file-like object, or a raw string containing an XSLT script.
    This stylesheet should flatten complex, deeply nested XML documents
    for easier parsing. To use this feature you must have ``lxml`` module
    installed and specify 'lxml' as ``parser``. The ``xpath`` must
    reference nodes of transformed XML document generated after XSLT
    transformation and not the original XML document. Only XSLT 1.0
    scripts and not later versions is currently supported.

iterparse : dict, optional
    The nodes or attributes to retrieve in iterparsing of XML document
    as a dict with key being the name of repeating element and value being
    list of elements or attribute names that are descendants of the repeated
    element. Note: If this option is used, it will replace ``xpath`` parsing
    and unlike xpath, descendants do not need to relate to each other but can
    exist any where in document under the repeating element. This memory-
    efficient method should be used for very large XML files (500MB, 1GB, or 5GB+).
    For example, ::

        iterparse = {"row_element": ["child_elem", "attr", "grandchild_elem"]}

    .. versionadded:: 1.5.0

compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and 'path_or_buffer' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
    Set to ``None`` for no decompression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'tar'``} and other
    key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdDecompressor`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

    .. versionchanged:: 1.4.0 Zstandard support.

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib.request.Request`` as header options. For other
    URLs (e.g. starting with "s3://", and "gcs://") the key-value pairs are
    forwarded to ``fsspec.open``. Please see ``fsspec`` and ``urllib`` for more
    details, and for more examples on storage options refer `here
    <https://pandas.pydata.org/docs/user_guide/io.html?
    highlight=storage_options#reading-writing-remote-files>`_.

Returns
-------
df
    A DataFrame.

See Also
--------
read_json : Convert a JSON string to pandas object.
read_html : Read HTML tables into a list of DataFrame objects.

Notes
-----
This method is best designed to import shallow XML documents in
following format which is the ideal fit for the two-dimensions of a
``DataFrame`` (row by column). ::

        <root>
            <row>
              <column1>data</column1>
              <column2>data</column2>
              <column3>data</column3>
              ...
           </row>
           <row>
              ...
           </row>
           ...
        </root>

As a file format, XML documents can be designed any way including
layout of elements and attributes as long as it conforms to W3C
specifications. Therefore, this method is a convenience handler for
a specific flatter design and not all possible XML structures.

However, for more complex XML documents, ``stylesheet`` allows you to
temporarily redesign original document with XSLT (a special purpose
language) for a flatter version for migration to a DataFrame.

This function will *always* return a single :class:`DataFrame` or raise
exceptions due to issues with XML document, ``xpath``, or other
parameters.

See the :ref:`read_xml documentation in the IO section of the docs
<io.read_xml>` for more information in using this method to parse XML
files to DataFrames.

Examples
--------
>>> xml = '''<?xml version='1.0' encoding='utf-8'?>
... <data xmlns="http://example.com">
...  <row>
...    <shape>square</shape>
...    <degrees>360</degrees>
...    <sides>4.0</sides>
...  </row>
...  <row>
...    <shape>circle</shape>
...    <degrees>360</degrees>
...    <sides/>
...  </row>
...  <row>
...    <shape>triangle</shape>
...    <degrees>180</degrees>
...    <sides>3.0</sides>
...  </row>
... </data>'''

>>> df = pd.read_xml(xml)
>>> df
      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

>>> xml = '''<?xml version='1.0' encoding='utf-8'?>
... <data>
...   <row shape="square" degrees="360" sides="4.0"/>
...   <row shape="circle" degrees="360"/>
...   <row shape="triangle" degrees="180" sides="3.0"/>
... </data>'''

>>> df = pd.read_xml(xml, xpath=".//row")
>>> df
      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

>>> xml = '''<?xml version='1.0' encoding='utf-8'?>
... <doc:data xmlns:doc="https://example.com">
...   <doc:row>
...     <doc:shape>square</doc:shape>
...     <doc:degrees>360</doc:degrees>
...     <doc:sides>4.0</doc:sides>
...   </doc:row>
...   <doc:row>
...     <doc:shape>circle</doc:shape>
...     <doc:degrees>360</doc:degrees>
...     <doc:sides/>
...   </doc:row>
...   <doc:row>
...     <doc:shape>triangle</doc:shape>
...     <doc:degrees>180</doc:degrees>
...     <doc:sides>3.0</doc:sides>
...   </doc:row>
... </doc:data>'''

>>> df = pd.read_xml(xml,
...                  xpath="//doc:row",
...                  namespaces={"doc": "https://example.com"})
>>> df
      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0
File:      c:\users\jrjos\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages\pandas\io\xml.py
Type:      function